{"data":{"allMediumPost":{"edges":[{"node":{"id":"ec37c9ca6033","title":"How to integrate Redux into your application with React Native and Expo","virtuals":{"subtitle":"Redux is an important part of the React Native ecosystem. If your world revolves around JavaScript, you’ve probably heard about Redux…","previewImage":{"imageId":"1*_5uIwZnr1Yhwq1PnBv7C7A.jpeg"}}}},{"node":{"id":"107f6779a831","title":"Week 3 with React Native","virtuals":{"subtitle":"This week has been a hectic one for me. Deadline coming closer, and too many tasks to complete. It has been a happening one also. I got the…","previewImage":{"imageId":"1*N27t9VfoqJodFJpn0niqng.png"}}}},{"node":{"id":"ca50fcfcb1e1","title":"Week 2 With React Native: Building a Weather App","virtuals":{"subtitle":"Week 2 with React Native ⚛️ + 📱","previewImage":{"imageId":"1*CHlmMV90-WTtWfbBUjBmfw.png"}}}},{"node":{"id":"aff0dbdf5909","title":"Starting Over with React Native","virtuals":{"subtitle":"Start of 2018 🚀","previewImage":{"imageId":"1*wvdS2ESzBWrFvpBjoNavCQ.png"}}}},{"node":{"id":"17dd2673979e","title":"How to Upload a File with Reactjs and Nodejs","virtuals":{"subtitle":"Uploading Files might seem a task that needs to be conquered especially if you are getting into web development. In this tutorial, simple…","previewImage":{"imageId":"1*yDFqFIcXFinfWdDUFUECbw.jpeg"}}}},{"node":{"id":"fe7066e02c09","title":"Building a Minimalist Weather App with React Native and Expo","virtuals":{"subtitle":"React Native is a great framework to develop cross-platform mobile applications for the platforms iOS and Android. In this, I’m going to…","previewImage":{"imageId":"1*NR-hMkFMHWqicy6QUa8XxQ.jpeg"}}}},{"node":{"id":"9124731c7fcc","title":"Boost Your Blogging Confidence and Write that Post","virtuals":{"subtitle":"Don’t wait. The time will never be just right. -Napoleon Hill","previewImage":{"imageId":"1*zHN7_6GG3n3pBBeOMGBCTg.png"}}}},{"node":{"id":"8b2105fbb496","title":"React Native: Getting Started with Lottie and Expo","virtuals":{"subtitle":"In this tutorial, we will be using Lottie with React Native. Lottie is an opensource library that renders Adobe Effects by providing easy…","previewImage":{"imageId":"1*1XY5UrlrTzTxOR6hgx7jnQ.jpeg"}}}},{"node":{"id":"6ef92d9b27ec","title":"React Native: Building a Minimalist Weather App using Expo XDE","virtuals":{"subtitle":"React Native is a great framework to develop cross-platform mobile applications for the platforms iOS and Android. In this, I am going to…","previewImage":{"imageId":"1*NR-hMkFMHWqicy6QUa8XxQ.jpeg"}}}},{"node":{"id":"a36c450a8a2f","title":"React Native: How to Setup Your First App","virtuals":{"subtitle":"React Native is a framework for building mobile applications with JavaScript and leveraging Reactjs. It uses native UI components. If you…","previewImage":{"imageId":"1*wR-gQwWFK2oNmy8xdL0Sxg.png"}}}}]}},"pageContext":{}}